#!/usr/bin/env python
#-*- coding: utf-8 -*-

#2016年 07月 13日 星期三 11:42:13 CST By Demobin

import re
import math
import handle_num as cnnum

normal_map = {
        u'小时':    u'时',
        u'分钟':    u'分',
        u'秒钟':    u'秒',
        }

formular = {
        u'angle': {
            u'calc': {
                u'圆周': u'(x*2.777778)/1000_圆周',
                u'直角': u'(x*11.111111)/1000_直角',
                u'百分度': u'(x*1.111111)_百分度_(gon)',
                u'度': u'(x*1.0)_度_(°)',
                u'分': u'(x*60.0)_分_( ′)',
                u'秒': u'(x*3600.0)_秒_(")',
                u'弧度': u'(x*17.453293)/1000_弧度_(rad)',
                u'毫弧度': u'(x*17.453293)_毫弧度_(mrad)'
                },
            u'init': {
                u'圆周': u'(x*360.0)_度',
                u'直角': u'(x*90.0)_度',
                u'百分度': u'(x*900.0)/1000_度',
                u'度': u'(x*1.0)_度',
                u'分': u'(x*16.666667)/1000_度',
                u'秒': u'(x*0.2777778)/1000_度',
                u'弧度': u'(x*57.295780)_度',
                u'毫弧度': u'(x*57.295780)/1000_度'
                },
            u'iu': u'角度(°)',
            u'group': [
                {
                    u'name': u'角度制',
                    u'list': [
                        u'圆周',
                        u'直角',
                        u'百分度_(gon)',
                        u'度_(°)',
                        u'分_( ′)',
                        u'秒_(")'
                        ]
                    },
                {
                    u'name': u'弧度制',
                    u'list': [
                        u'弧度_(rad)',
                        u'毫弧度_(mrad)'
                        ]
                    }
                ]
            },
        u'area': {
            u'calc': {
                u'平方千米': u'(x*1.0)/1000000_平方千米_(km²)',
                u'公顷': u'(x*1.0)/10000_公顷_(ha)',
                u'公亩': u'(x*1.0)/100_公亩_(are)',
                u'平方米': u'(x*1.0)/1_平方米_(㎡)',
                u'平方分米': u'(x*1.0)/0.01_平方分米_(dm²)',
                u'平方厘米': u'(x*1.0)/0.0001_平方厘米_(cm²)',
                u'平方毫米': u'(x*1.0)/0.000001_平方毫米_(mm²)',
                u'英亩': u'(x*1.0)/(math.pow(0.3048,2)*math.pow(16.5,2)*160)_英亩_(acre)',
                u'平方英里': u'(x*1.0)/math.pow((0.3048*3*1760),2)_平方英里_(sq.mi)',
                u'平方码': u'(x*1.0)/(math.pow(0.3048,2)*9)_平方码_(sq.yd)',
                u'平方英尺': u'(x*1.0)/math.pow(0.3048,2)_平方英尺_(sq.ft)',
                u'平方英寸': u'(x*1.0)/(math.pow(0.3048,2)/144)_平方英寸_(sq.in)',
                u'平方竿': u'(x*1.0)/(math.pow(0.3048,2)*math.pow(16.5,2))_平方竿_(sq.rd)',
                u'顷': u'(x*1.0)/(100/0.0015)_顷',
                u'亩': u'(x*1.0)/(1/0.0015)_亩',
                u'平方尺': u'(x*1.0)/(1.0/9)_平方尺',
                u'平方寸': u'(x*1.0)/(0.01/9)_平方寸'
                },
            u'init': {
                u'平方千米': u'(x*1000000.0)/1_平方米',
                u'公顷': u'(x*10000.0)/1_平方米',
                u'公亩': u'(x*100.0)/1_平方米',
                u'平方米': u'(x*1.0)/1_平方米',
                u'平方分米': u'(x*0.01)/1_平方米',
                u'平方厘米': u'(x*0.0001)/1_平方米',
                u'平方毫米': u'(x*0.000001)/1_平方米',
                u'英亩': u'(x*(math.pow(0.3048,2)*math.pow(16.5,2)*160))/1_平方米',
                u'平方英里': u'(x*math.pow((0.3048*3*1760),2))/1_平方米',
                u'平方码': u'(x*(math.pow(0.3048,2)*9))/1_平方米',
                u'平方英尺': u'(x*(math.pow(0.3048,2)))/1_平方米',
                u'平方英寸': u'(x*(math.pow(0.3048,2)/144))/1_平方米',
                u'平方竿': u'(x*(math.pow(0.3048,2)*math.pow(16.5,2)))/1_平方米',
                u'顷': u'(x*(100/0.0015))/1_平方米',
                u'亩': u'(x*(1/0.0015))/1_平方米',
                u'平方尺': u'(x*(1.0/9))/1_平方米',
                u'平方寸': u'(x*(0.01/9))/1_平方米'
                },
            u'iu': u'平方米(㎡)',
            u'group': [
                {
                    u'name': u'公制',
                    u'list': [
                        u'平方千米_(km²)',
                        u'公顷_(ha)',
                        u'公亩_(are)',
                        u'平方米_(㎡)',
                        u'平方分米_(dm²)',
                        u'平方厘米_(cm²)',
                        u'平方毫米_(mm²)'
                        ]
                    },
                {
                    u'name': u'英制',
                    u'list': [
                        u'英亩_(acre)',
                        u'平方英里_(sq.mi)',
                        u'平方码_(sq.yd)',
                        u'平方英尺_(sq.ft)',
                        u'平方英寸_(sq.in)',
                        u'平方竿_(sq.rd)'
                        ]
                    },
                {
                    u'name': u'市制',
                    u'list': [
                        u'顷',
                        u'亩',
                        u'平方尺',
                        u'平方寸'
                        ]
                    }
                ]
            },
    u'byte': {
            u'calc': {
                u'比特': u'(x*8.0)_比特_(bit)',
                u'字节': u'(x*1.0)_字节_(b)',
                u'千字节': u'(x*1.0)/(math.pow(2,10))_千字节_(kb)',
                u'兆字节': u'(x*1.0)/(math.pow(2,20))_兆字节_(mb)',
                u'千兆字节': u'(x*1.0)/(math.pow(2,30))_千兆字节_(gb)',
                u'太字节': u'(x*1.0)/(math.pow(2,40))_太字节_(tb)',
                u'拍字节': u'(x*1.0)/(math.pow(2,50))_拍字节_(pb)',
                u'艾字节': u'(x*1.0)/(math.pow(2,60))_艾字节_(eb)'
                },
            u'init': {
                u'比特': u'(x*1.0)/8_字节',
                u'字节': u'(x*1.0)_字节',
                u'千字节': u'(x*1024.0)_字节',
                u'兆字节': u'(x*math.pow(2,20))_字节',
                u'千兆字节': u'(x*math.pow(2,30))_字节',
                u'太字节': u'(x*math.pow(2,40))_字节',
                u'拍字节': u'(x*math.pow(2,50))_字节',
                u'艾字节': u'(x*math.pow(2,60))_字节'
                },
            u'iu': u'字节(b)',
            u'group': [
                {
                    u'name': u'',
                    u'list': [
                        u'比特_(bit)',
                        u'字节_(b)',
                        u'千字节_(kb)',
                        u'兆字节_(mb)',
                        u'千兆字节_(gb)',
                        u'太字节_(tb)',
                        u'拍字节_(pb)',
                        u'艾字节_(eb)'
                        ]
                    }
                ]
            },
    u'density': {
            u'calc': {
                u'千克/立方厘米': u'(x*1.0)/(math.pow(10,6))_千克/立方厘米_(kg/cm³)',
                u'千克/立方分米': u'(x*1.0)/1000_千克/立方分米_(kg/dm³)',
                u'千克/立方米': u'(x*1.0)_千克/立方米_(kg/m³)',
                u'克/立方厘米': u'(x*1.0)/1000_克/立方厘米_(g/cm³)',
                u'克/立方分米': u'(x*1.0)_克/立方分米_(g/dm³)',
                u'克/立方米': u'(x*1000.0)_克/立方米_(g/m³)'
                },
            u'init': {
                u'千克/立方厘米': u'(x*1000000.0)_千克/立方米',
                u'千克/立方分米': u'(x*1000.0)_千克/立方米',
                u'千克/立方米': u'(x*1.0)_千克/立方米',
                u'克/立方厘米': u'(x*1000.0)_千克/立方米',
                u'克/立方分米': u'(x*1.0)_千克/立方米',
                u'克/立方米': u'(x*1.0)/1000_千克/立方米'
                },
            u'iu': u'千克/立方米(kg/m³)',
            u'group': [
                {
                    u'name': u'',
                    u'list': [
                        u'千克/立方厘米_(kg/cm³)',
                        u'千克/立方分米_(kg/dm³)',
                        u'千克/立方米_(kg/m³)',
                        u'克/立方厘米_(g/cm³)',
                        u'克/立方分米_(g/dm³)',
                        u'克/立方米_(g/m³)'
                        ]
                    }
                ]
            },
    u'length': {
            u'calc': {
                u'千米': u'(x*1.0)/1000_千米_(km)',
                u'米': u'(x*1.0)/1_米_(m)',
                u'分米': u'(x*1.0)/0.1_分米_(dm)',
                u'厘米': u'(x*1.0)/0.01_厘米_(cm)',
                u'毫米': u'(x*1.0)/0.001_毫米_(mm)',
                u'微米': u'(x*1.0)/0.000001_微米_(um)',
                u'英寸': u'(x*1.0)/(0.3048/12)_英寸_(in)',
                u'英尺': u'(x*1.0)/0.3048_英尺_(ft)',
                u'码': u'(x*1.0)/(0.3048*3)_码_(yd)',
                u'英里': u'(x*1.0)/(0.3048*3*1760)_英里_(mi)',
                u'海里': u'(x*1.0)/1852_海里_(nmi)',
                u'英寻': u'(x*1.0)/1.8288_英寻_(fm)',
                u'弗隆': u'(x*1.0)/201.168_弗隆_(fur)',
                u'里': u'(x*1.0)/500_里',
                u'丈': u'(x*1.0)/(10.0/3)_丈',
                u'尺': u'(x*1.0)/(1.0/3)_尺',
                u'寸': u'(x*1.0)/(0.1/3)_寸',
                u'分': u'(x*1.0)/(0.01/3)_分',
                u'厘': u'(x*1.0)/(0.001/3)_厘',
                u'毫': u'(x*1.0)/(0.0001/3)_毫'
                },
            u'init': {
                u'千米': u'(x*1000.0)/1_米',
                u'米': u'(x*1.0)/1_米',
                u'分米': u'(x*0.1)/1_米',
                u'厘米': u'(x*0.01)/1_米',
                u'毫米': u'(x*0.001)/1_米',
                u'微米': u'(x*0.000001)/1_米',
                u'英寸': u'(x*(0.3048/12))/1_米',
                u'英尺': u'(x*0.3048)/1_米',
                u'码': u'(x*(0.3048*3))/1_米',
                u'英里': u'(x*(0.3048*3*1760))/1_米',
                u'海里': u'(x*1852.0)/1_米',
                u'英寻': u'(x*1.8288)/1_米',
                u'弗隆': u'(x*201.168)/1_米',
                u'里': u'(x*500.0)/1_米',
                u'丈': u'(x*(10.0/3))/1_米',
                u'尺': u'(x*(1.0/3))/1_米',
                u'寸': u'(x*(0.1/3))/1_米',
                u'分': u'(x*(0.01/3))/1_米',
                u'厘': u'(x*(0.001/3))/1_米',
                u'毫': u'(x*(0.0001/3))/1_米'
                },
            u'iu': u'米(m)',
            u'group': [
                {
                    u'name': u'公制',
                    u'list': [
                        u'千米_(km)',
                        u'米_(m)',
                        u'分米_(dm)',
                        u'厘米_(cm)',
                        u'毫米_(mm)',
                        u'微米_(um)'
                        ]
                    },
                {
                    u'name': u'英制',
                    u'list': [
                        u'英寸_(in)',
                        u'英尺_(ft)',
                        u'码_(yd)',
                        u'英里_(mi)',
                        u'海里_(nmi)',
                        u'英寻_(fm)',
                        u'弗隆_(fur)'
                        ]
                    },
                {
                    u'name': u'市制',
                    u'list': [
                        u'里',
                        u'丈',
                        u'尺',
                        u'寸',
                        u'分',
                        u'厘',
                        u'毫'
                        ]
                    }
                ]
            },
    u'power': {
            u'calc': {
                u'瓦': u'(x*1.0)/1_瓦_(W)',
                u'千瓦': u'(x*1.0)/1000_千瓦_(kW)',
                u'英制马力': u'(x*1.0)/745.699872_英制马力_(hp)',
                u'米制马力': u'(x*1.0)/(9.80665*75)_米制马力_(ps)',
                u'公斤·米/秒': u'(x*1.0)/9.80665_公斤·米/秒_(kg·m/s)',
                u'千卡/秒': u'(x*1.0)/4184.1004_千卡/秒_(kcal/s)',
                u'英热单位/秒': u'(x*1.0)/1055.05585_英热单位/秒_(Btu/s)',
                u'英尺·磅/秒': u'(x*1.0)/(745.699872/550)_英尺·磅/秒_(ft·lb/s)',
                u'焦耳/秒': u'(x*1.0)/1_焦耳/秒_(J/s)',
                u'牛顿·米/秒': u'(x*1.0)/1_牛顿·米/秒_(N·m/s)'
                },
            u'init': {
                u'瓦': u'(x*1.0)/1_瓦',
                u'千瓦': u'(x*1000.0)/1_瓦',
                u'英制马力': u'(x*745.699872)/1_瓦',
                u'米制马力': u'(x*(9.80665*75))/1_瓦',
                u'公斤·米/秒': u'(x*9.80665)/1_瓦',
                u'千卡/秒': u'(x*4184.1004)/1_瓦',
                u'英热单位/秒': u'(x*1055.05585)/1_瓦',
                u'英尺·磅/秒': u'(x*(745.699872/550))/1_瓦',
                u'焦耳/秒': u'(x*1.0)/1_瓦',
                u'牛顿·米/秒': u'(x*1.0)/1_瓦'
                },
            u'iu': u'瓦(W)',
            u'group': [
                {
                    u'name': u'',
                    u'list': [
                        u'瓦_(W)',
                        u'千瓦_(kW)',
                        u'英制马力_(hp)',
                        u'米制马力_(ps)',
                        u'公斤·米/秒_(kg·m/s)',
                        u'千卡/秒_(kcal/s)',
                        u'英热单位/秒_(Btu/s)',
                        u'英尺·磅/秒_(ft·lb/s)',
                        u'焦耳/秒_(J/s)',
                        u'牛顿·米/秒_(N·m/s)'
                        ]
                    }
                ]
            },
    u'pressure': {
            u'calc': {
                u'帕斯卡': u'(x*1.0)/1_帕斯卡_(Pa)',
                u'千帕': u'(x*1.0)/1000_千帕_(kpa)',
                u'百帕': u'(x*1.0)/100_百帕_(hpa)',
                u'标准大气压': u'(x*1.0)/101325_标准大气压_(atm)',
                u'毫米汞柱': u'(x*1.0)/(101325/760)_毫米汞柱_(mmHg)',
                u'英寸汞柱': u'(x*1.0)/(101325/760*25.4)_英寸汞柱_(in Hg)',
                u'巴': u'(x*1.0)/100000_巴_(bar)',
                u'毫巴': u'(x*1.0)/100_毫巴_(mbar)',
                u'磅力/平方英尺': u'(x*1.0)/(6894.757/144)_磅力/平方英尺_(psf)',
                u'磅力/平方英寸': u'(x*1.0)/6894.757_磅力/平方英寸_(psi)',
                u'毫米水柱': u'(x*1.0)/(1/0.101972)_毫米水柱',
                u'公斤力/平方厘米': u'(x*1.0)/98066.5_公斤力/平方厘米_(kgf/cm²)',
                u'公斤力/平方米': u'(x*1.0)/9.80665_公斤力/平方米_(kgf/㎡)'
                },
            u'init': {
                u'帕斯卡': u'(x*1.0)/1_帕斯卡',
                u'千帕': u'(x*1000.0)/1_帕斯卡',
                u'百帕': u'(x*100.0)/1_帕斯卡',
                u'标准大气压': u'(x*101325.0)/1_帕斯卡',
                u'毫米汞柱': u'(x*(101325.0/760))/1_帕斯卡',
                u'英寸汞柱': u'(x*(101325/760*25.4))/1_帕斯卡',
                u'巴': u'(x*100000.0)/1_帕斯卡',
                u'毫巴': u'(x*100.0)/1_帕斯卡',
                u'磅力/平方英尺': u'(x*(6894.757/144))/1_帕斯卡',
                u'磅力/平方英寸': u'(x*6894.757)/1_帕斯卡',
                u'毫米水柱': u'(x*(1/0.101972))/1_帕斯卡',
                u'公斤力/平方厘米': u'(x*98066.5)/1_帕斯卡',
                u'公斤力/平方米': u'(x*9.80665)/1_帕斯卡'
                },
            u'iu': u'帕斯卡(Pa)',
            u'group': [
                {
                    u'name': u'',
                    u'list': [
                        u'帕斯卡_(Pa)',
                        u'千帕_(kpa)',
                        u'百帕_(hpa)',
                        u'标准大气压_(atm)',
                        u'毫米汞柱_(mmHg)',
                        u'英寸汞柱_(in Hg)',
                        u'巴_(bar)',
                        u'毫巴_(mbar)',
                        u'磅力/平方英尺_(psf)',
                        u'磅力/平方英寸_(psi)',
                        u'毫米水柱',
                        u'公斤力/平方厘米_(kgf/cm²)',
                        u'公斤力/平方米_(kgf/㎡)'
                        ]
                    }
                ]
            },
    u'speed': {
            u'calc': {
                u'米/秒': u'(x*1.0)_米/秒_(m/s)',
                u'千米/秒': u'(x*1.0)/1000_千米/秒_(km/s)',
                u'千米/时': u'(x*3.600000)_千米/时_(km/h)',
                u'光速': u'(x*3.335641)/(math.pow(10,9))_光速_(c)',
                u'马赫': u'(x*2.938584)/1000_马赫_(mach)',
                u'英里/时': u'(x*2.236936)_英里/时_(mile/h)',
                u'英寸/秒': u'(x*39.370079)_英寸/秒_(in/s)'
                },
            u'init': {
                u'米/秒': u'(x*1.0)_米/秒',
                u'千米/秒': u'(x*1000.0)_米/秒',
                u'千米/时': u'(x*277.777778)/1000_米/秒',
                u'光速': u'(x*299792458.0)_米/秒',
                u'马赫': u'(x*340.300000)_米/秒',
                u'英里/时': u'(x*447.040000)/1000_米/秒',
                u'英寸/秒': u'(x*25.400000)/1000_米/秒'
                },
            u'iu': u'米/秒(m/s)',
            u'group': [
                {
                    u'name': u'',
                    u'list': [
                        u'米/秒_(m/s)',
                        u'千米/秒_(km/s)',
                        u'千米/时_(km/h)',
                        u'光速_(c)',
                        u'马赫_(mach)',
                        u'英里/时_(mile/h)',
                        u'英寸/秒_(in/s)'
                        ]
                    }
                ]
            },
    u'strength': {
            u'calc': {
                u'牛': u'(x*1.0)_牛_(N)',
                u'千牛': u'(x*1.0)/1000_千牛_(kN)',
                u'千克力': u'(x*101.971621)/1000_千克力_(kgf)',
                u'克力': u'(x*101.971621)_克力_(gf)',
                u'公吨力': u'(x*101.971621)/(math.pow(10,6))_公吨力_(tf)',
                u'磅力': u'(x*224.808943)/1000_磅力_(lbf)',
                u'千磅力': u'(x*224.808943)/(math.pow(10,6))_千磅力_(kip)'
                },
            u'init': {
                u'牛': u'(x*1.0)_牛',
                u'千牛': u'(x*1000.0)_牛',
                u'千克力': u'(x*9.806650)_牛',
                u'克力': u'(x*9.806650)/1000_牛',
                u'公吨力': u'(x*9806.650000)_牛',
                u'磅力': u'(x*4.448222)_牛',
                u'千磅力': u'(x*4448.221615)_牛'
                },
            u'iu': u'牛(N)',
            u'group': [
                {
                    u'name': u'',
                    u'list': [
                        u'牛_(N)',
                        u'千牛_(kN)',
                        u'千克力_(kgf)',
                        u'克力_(gf)',
                        u'公吨力_(tf)',
                        u'磅力_(lbf)',
                        u'千磅力_(kip)'
                        ]
                    }
                ]
            },
    u'temperature': {
            u'calc': {
                u'摄氏度': u'(x-273.15)/1_摄氏度_(℃)',
                u'华氏度': u'(32+((x-273.15)*9/5))_华氏度_(℉)',
                u'开氏度': u'(x-273.15)+273.15_开氏度_(K)',
                u'兰氏度': u'((x-273.15)+273.15)*1.8_兰氏度_(°R)',
                u'列氏度': u'(x-273.15)/1.25_列氏度_(°Re)'
                },
            u'init': {
                u'摄氏度': u'(x*1.0)+273.15_开氏度',
                u'华氏度': u'(5*(x-32)/9)+273.15_开氏度',
                u'开氏度': u'(x-273.15)+273.15_开氏度',
                u'兰氏度': u'(x/1.8-273.15)+273.15_开氏度',
                u'列氏度': u'(x*1.25)+273.15_开氏度'
                },
            u'iu': u'开氏度(K)',
            u'group': [
                {
                    u'name': u'',
                    u'list': [
                        u'摄氏度_(℃)',
                        u'华氏度_(℉)',
                        u'开氏度_(K)',
                        u'兰氏度_(°R)',
                        u'列氏度_(°Re)'
                        ]
                    }
                ]
            },
    u'time': {
            u'calc': {
                u'年': u'(x*31.709792)/(math.pow(10,9))_年_(yr)',
                u'周': u'(x*1.653439)/(math.pow(10,6))_周_(week)',
                u'天': u'(x*11.574074)/(math.pow(10,6))_天_(d)',
                u'时': u'(x*277.777778)/(math.pow(10,6))_时_(h)',
                u'分': u'(x*16.666667)/1000_分_(min)',
                u'秒': u'(x*1.0)_秒_(s)',
                u'毫秒': u'(x*1000.0)_毫秒_(ms)'
                },
            u'init': {
                u'年': u'(x*31536000.0)_秒',
                u'周': u'(x*604800.0)_秒',
                u'天': u'(x*86400.0)_秒',
                u'时': u'(x*3600.0)_秒',
                u'分': u'(x*60.0)_秒',
                u'秒': u'(x*1.0)_秒',
                u'毫秒': u'(x*1.0)/1000_秒'
                },
            u'iu': u'秒(s)',
            u'group': [
                {
                    u'name': u'',
                    u'list': [
                        u'年_(yr)',
                        u'周_(week)',
                        u'天_(d)',
                        u'时_(h)',
                        u'分_(min)',
                        u'秒_(s)',
                        u'毫秒_(ms)'
                        ]
                    }
                ],
            u'special': {
                u'时-分': u'(x*60.0)_分_(min)'
                }
            },
    u'volume': {
            u'calc': {
                u'立方米': u'(x*1.0)/1_立方米_(m³)',
                u'立方分米': u'(x*1.0)/0.001_立方分米_(dm³)',
                u'立方厘米': u'(x*1.0)/0.000001_立方厘米_(cm³)',
                u'立方毫米': u'(x*1.0)/0.000000001_立方毫米_(mm³)',
                u'升': u'(x*1.0)/0.001_升_(l)',
                u'分升': u'(x*1.0)/0.0001_分升_(dl)',
                u'毫升': u'(x*1.0)/0.000001_毫升_(ml)',
                u'厘升': u'(x*1.0)/0.00001_厘升_(cl)',
                u'公石': u'(x*1.0)/0.1_公石_(hl)',
                u'立方英尺': u'(x*1.0)/0.0283168_立方英尺_(cu ft)',
                u'立方英寸': u'(x*1.0)/(0.0283168/1728)_立方英寸_(cu in)',
                u'立方码': u'(x*1.0)/(0.0283168*27)_立方码_(cu yd)',
                u'亩英尺': u'(x*1.0)/(43560*1728*0.016387064/1000)_亩英尺',
                u'英制加仑': u'(x*1.0)/0.00454609188_英制加仑_(uk gal)',
                u'美制加仑': u'(x*1.0)/(231*0.016387064/1000)_美制加仑_(us gal)'
                },
            u'init': {
                u'立方米': u'(x*1.0)/1_立方米',
                u'立方分米': u'(x*0.001)/1_立方米',
                u'立方厘米': u'(x*0.000001)/1_立方米',
                u'立方毫米': u'(x*0.000000001)/1_立方米',
                u'升': u'(x*0.001)/1_立方米',
                u'分升': u'(x*0.0001)/1_立方米',
                u'毫升': u'(x*0.000001)/1_立方米',
                u'厘升': u'(x*0.00001)/1_立方米',
                u'公石': u'(x*0.1)/1_立方米',
                u'立方英尺': u'(x*0.0283168)/1_立方米',
                u'立方英寸': u'(x*(0.0283168/1728))/1_立方米',
                u'立方码': u'(x*(0.0283168*27))/1_立方米',
                u'亩英尺': u'(x*(43560*1728*0.016387064/1000))/1_立方米',
                u'英制加仑': u'(x*0.00454609188)/1_立方米',
                u'美制加仑': u'(x*(231*0.016387064/1000))/1_立方米'
                },
            u'iu': u'立方米(m³)',
            u'group': [
                {
                    u'name': u'公制',
                    u'list': [
                        u'立方米_(m³)',
                        u'立方分米_(dm³)',
                        u'立方厘米_(cm³)',
                        u'立方毫米_(mm³)',
                        u'升_(l)',
                        u'分升_(dl)',
                        u'毫升_(ml)',
                        u'厘升_(cl)',
                        u'公石_(hl)'
                        ]
                    },
                {
                    u'name': u'英制',
                    u'list': [
                        u'立方英尺_(cu ft)',
                        u'立方英寸_(cu in)',
                        u'立方码_(cu yd)',
                        u'亩英尺',
                        u'英制加仑_(uk gal)',
                        u'美制加仑_(us gal)'
                        ]
                    }
                ]
            },
    u'weight': {
            u'calc': {
                u'千克': u'(x*1.0)/1_千克_(kg)',
                u'克': u'(x*1.0)/0.001_克_(g)',
                u'毫克': u'(x*1.0)/0.000001_毫克_(mg)',
                u'吨': u'(x*1.0)/1000_吨_(t)',
                u'公担': u'(x*1.0)/100_公担_(q)',
                u'磅': u'(x*1.0)/0.45359237_磅_(lb)',
                u'盎司': u'(x*1.0)/(0.45359237/16)_盎司_(oz)',
                u'克拉': u'(x*1.0)/0.0002_克拉_(ct)',
                u'格令': u'(x*1.0)/(0.45359237/7000)_格令_(gr)',
                u'长吨': u'(x*1.0)/(0.45359237*2240)_长吨_(lt)',
                u'短吨': u'(x*1.0)/(0.45359237*2000)_短吨_(st)',
                u'英担': u'(x*1.0)/(0.45359237*112)_英担',
                u'美担': u'(x*1.0)/(0.45359237*100)_美担',
                u'英石': u'(x*1.0)/(0.45359237*14)_英石_(st)',
                u'打兰': u'(x*1.0)/(0.45359237/256)_打兰_(dr)',
                u'担': u'(x*1.0)/50_担',
                u'斤': u'(x*1.0)/0.5_斤',
                u'两': u'(x*1.0)/0.05_两',
                u'钱': u'(x*1.0)/0.005_钱'
                },
            u'init': {
                u'千克': u'(x*1.0)/1_千克',
                u'克': u'(x*0.001)/1_千克',
                u'毫克': u'(x*0.000001)/1_千克',
                u'吨': u'(x*1000.0)/1_千克',
                u'公担': u'(x*100.0)/1_千克',
                u'磅': u'(x*0.45359237)/1_千克',
                u'盎司': u'(x*(0.45359237/16))/1_千克',
                u'克拉': u'(x*0.0002)/1_千克',
                u'格令': u'(x*(0.45359237/7000))/1_千克',
                u'长吨': u'(x*(0.45359237*2240))/1_千克',
                u'短吨': u'(x*(0.45359237*2000))/1_千克',
                u'英担': u'(x*(0.45359237*112))/1_千克',
                u'美担': u'(x*(0.45359237*100))/1_千克',
                u'英石': u'(x*(0.45359237*14))/1_千克',
                u'打兰': u'(x*(0.45359237/256))/1_千克',
                u'担': u'(x*50.0)/1_千克',
                u'斤': u'(x*0.5)/1_千克',
                u'两': u'(x*0.05)/1_千克',
                u'钱': u'(x*0.005)/1_千克'
                },
            u'iu': u'千克(kg)',
            u'group': [
                {
                    u'name': u'公制',
                    u'list': [
                        u'千克_(kg)',
                        u'克_(g)',
                        u'毫克_(mg)',
                        u'吨_(t)',
                        u'公担_(q)'
                        ]
                    },
                {
                    u'name': u'英制',
                    u'list': [
                        u'磅_(lb)',
                        u'盎司_(oz)',
                        u'克拉_(ct)',
                        u'格令_(gr)',
                        u'长吨_(lt)',
                        u'短吨_(st)',
                        u'英担',
                        u'美担',
                        u'英石_(st)',
                        u'打兰_(dr)'
                        ]
                    },
                {
                    u'name': u'市制',
                    u'list': [
                        u'担',
                        u'斤',
                        u'两',
                        u'钱'
                        ]
                    }
                ]
            },
    u'work': {
            u'calc': {
                u'焦耳': u'(x*1.0)/1_焦耳_(J)',
                u'公斤·米': u'(x*1.0)/9.80392157_公斤·米_(kg·m)',
                u'米制马力·时': u'(x*1.0)/(9.80665*75*3600)_米制马力·时_(ps·h)',
                u'英制马力·时': u'(x*1.0)/(745.699872*3600)_英制马力·时_(hp·h)',
                u'千瓦·时': u'(x*1.0)/3600000_千瓦·时_(kW·h)',
                u'卡': u'(x*1.0)/4.185851820846_卡_(cal)',
                u'千卡': u'(x*1.0)/4185.851820846_千卡_(kcal)',
                u'英热单位': u'(x*1.0)/1055.05585262_英热单位_(btu)',
                u'英尺·磅': u'(x*1.0)/1.3557483731_英尺·磅_(ft·lb)'
                },
            u'init': {
                u'焦耳': u'(x*1.0)/1_焦耳',
                u'公斤·米': u'(x*9.80392157)/1_焦耳',
                u'米制马力·时': u'(x*(9.80665*75*3600))/1_焦耳',
                u'英制马力·时': u'(x*(745.699872*3600))/1_焦耳',
                u'千瓦·时': u'(x*3600000.0)/1_焦耳',
                u'卡': u'(x*4.185851820846)/1_焦耳',
                u'千卡': u'(x*4185.851820846)/1_焦耳',
                u'英热单位': u'(x*1055.05585262)/1_焦耳',
                u'英尺·磅': u'(x*1.3557483731)/1_焦耳'
                },
            u'iu': u'焦耳(J)',
            u'group': [
                {
                    u'name': u'焦耳(J)',
                    u'list': [
                        u'焦耳_(J)',
                        u'公斤·米_(kg·m)',
                        u'米制马力·时_(ps·h)',
                        u'英制马力·时_(hp·h)',
                        u'千瓦·时_(kW·h)',
                        u'卡_(cal)',
                        u'千卡_(kcal)',
                        u'英热单位_(btu)',
                        u'英尺·磅_(ft·lb)'
                        ]
                    }
                ]
            }
    }

conj_dict = [
        u'是',
        u'有',
        u'等于',
        ]

ques_dict = [
        u'多少',
        u'几',
        ]

def entities():
    rst = {}
    for domain in formular:
        for unit in formular[domain]['init']:
            key = re.sub(u'·', '', unit)
            key = re.sub('/', u'每', key)
            rst[key] = (unit, domain)
    return rst

all_units = entities()

def calc(n, s):
    s = s.split('_')[0]
    s = re.sub('x', str(n), s)
    #print s
    rst = round(eval(s), 5)
    if int(rst) != 0 and rst % int(rst) == 0.0:
        rst = int(rst)
    return rst

def init(n, s):
    s = s.split('_')[0]
    s = re.sub('x', str(n), s)
    #print s
    return eval(s)

def convert(n, domain, src, dst):
    srcInit = init(n, formular[domain]['init'][src])
    dstN = calc(srcInit, formular[domain]['calc'][dst])
    return str(n) + src + '=' + str(dstN) + dst

def test():
    n = 100
    for domain in formular:
        src = re.sub('\(.*?\)', '', formular[domain]['iu'])
        if src == u'角度': src = u'度'
        print domain, src
        for dst in formular[domain]['init']:
            print convert(n, domain, src, dst)

def conv(text):
    #转中文转数字
    text = cnnum.cn_to_num(text)
    #print text
    #同义词正规化
    for m in normal_map:
        text = re.sub(m, normal_map[m], text)
    #取出所有数值备用
    nums = re.findall('\d+\.\d+|\d+', text)
    if(len(nums)) > 1: return None
    num = nums[0]
    #按数值和的还有运算符进行切割
    units = [unit for unit in all_units]
    #排序一下，否则会优先分割次方，匹配不到次方根
    units.sort(key=lambda x: len(x), reverse=True)
    splits = re.split(u'(\d+\.\d+|\d+|' + u'|'.join(units) + '|' + u'|'.join(ques_dict) + '|' +u'|'.join(conj_dict) + ')', text)
    #去掉空值
    splits = [split for split in splits if len(split) != 0]
    units2 = []
    valid = True
    for split in splits:
        if split == num: continue
        if split in units:
            units2.append(all_units[split])
        elif split not in ques_dict and split not in conj_dict:
            print split
            valid = False
            break
    if valid == False or len(units2) != 2 or units2[0][1] != units2[1][1]: return None

    domain = units2[0][1]
    src, dst = units2[0][0], units2[1][0]

    num = float(num)
    if int(num) != 0 and num % int(num) == 0.0:
        num = int(num)
    #print num, domain, src, dst
    return convert(num, domain, src, dst)

if __name__ == '__main__':
    #test()
    print conv(u'一万万分钟是多少天')
